DATA MERGE

In [14]:
import pandas as pd

data1 = {
    "id":[1,2,3],
    "name": ["Ali","Usman","Umar"],
    "age":[23,25,27], 
}

data2 = {
    'id':[1,2,3],
    'occupation':["Scholor","Ghani","Ameer"],
    'city': ["Makkah","Madina","Koofa"]
    }

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

merged_data = pd.merge(df1, df2, on="id", how="inner")
merged_data

   id   name  age occupation    city
0   1    Ali   23    Scholor  Makkah
1   2  Usman   25      Ghani  Madina
2   3   Umar   27      Ameer   Koofa

DATA CONCATENATION

In [32]:
import pandas as pd

dataset1 = {
    "Name": ["Alice", "Bob", "Carol", "Dave"],
    "Age": [25, 30, 22, 35],
    "Gender": ["Female", "Male", "Female", "Male"]
}

dataset2 = {
    "Name": ["Eve", "Frank", "Grace", "Henry"],
    "Age": [28, 32, 26, 40],
    "Gender": ["Female", "Male", "Female", "Male"]
}

dataset3 = {
    "Province": ["Ontario", "California", "Bavaria", "Queensland"],
    "Country": ["Canada", "USA", "Germany", "Australia"],
    "City": ["Toronto", "Los Angeles", "Munich", "Brisbane"]
}

df1 = pd.DataFrame(dataset1)
df2 = pd.DataFrame(dataset2)
df3 = pd.DataFrame(dataset3)


concat_vertically = pd.concat([df1,df2], axis=0) # axis = 0 is vertically! 
print(concat_vertically)
print("---------------------------------\n\n")

contact_Horizontally = pd.concat([df2,df3],axis=1) # axis = 1 is Horizontally! 
print(contact_Horizontally)
print("\n\n---------------------------------\n\n")

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Carol   22  Female
3   Dave   35    Male
0    Eve   28  Female
1  Frank   32    Male
2  Grace   26  Female
3  Henry   40    Male
---------------------------------


    Name  Age  Gender    Province    Country         City
0    Eve   28  Female     Ontario     Canada      Toronto
1  Frank   32    Male  California        USA  Los Angeles
2  Grace   26  Female     Bavaria    Germany       Munich
3  Henry   40    Male  Queensland  Australia     Brisbane


---------------------------------